In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
pieces = []
for year in range(1880, 2011):
    df = pd.read_csv("babynames/yob{}.txt".format(year),
                     names=['name', 'sex', 'births'], index_col=False)
    df['year'] = year
    pieces.append(df)

In [4]:
names = pd.concat(pieces, ignore_index=True)
len(names)

1690784

# 1. 가장 많이 사용된 알파벳 문자 구하기  
(1880~2010 까지 성별에 관계 없음)

In [168]:
# temp = []
# for i in range(10):
#     print(names.name[i], names.year[i])
#     for letter in list(names.name[i]):
#         temp.append((letter.lower(), names.year[i]))
# print(temp)

i = 0
for year in range(1880, 2011):
    dic = {}
    if names.year[i] == year:
        for letter in list(names.name[i]):
            if letter.lower() in dic.keys():
                dic[letter.lower()] += 1
            else:
                dic[letter.lower()] = 1
    else:
        
sdict = sorted(dic.items(), key=operator.itemgetter(1), reverse=True)
sdict #최대값b
# letters = pd.DataFrame(temp)
# letters

[('e', 1556),
 ('a', 1383),
 ('l', 1049),
 ('i', 950),
 ('n', 865),
 ('r', 851),
 ('o', 657),
 ('t', 535),
 ('s', 498),
 ('d', 415),
 ('m', 396),
 ('h', 357),
 ('c', 307),
 ('u', 270),
 ('y', 235),
 ('b', 197),
 ('g', 159),
 ('v', 149),
 ('p', 118),
 ('w', 112),
 ('j', 107),
 ('f', 104),
 ('k', 65),
 ('z', 46),
 ('x', 13),
 ('q', 6)]

# 2. 각 연도별로 가장 인기 있는 이름? (성별에 따라)

In [2]:
def get_top(group):
    return group.sort_values(by='births', ascending=False)[:1]

In [5]:
top_name = names.groupby(['year','sex']).apply(get_top)
top_name.reset_index(inplace=True, drop=True)
top_name

         name sex  births  year
0        Mary   F    7065  1880
1        John   M    9655  1880
2        Mary   F    6919  1881
3        John   M    8769  1881
4        Mary   F    8149  1882
..        ...  ..     ...   ...
257     Jacob   M   22507  2008
258  Isabella   F   22222  2009
259     Jacob   M   21036  2009
260  Isabella   F   22731  2010
261     Jacob   M   21875  2010

[262 rows x 4 columns]

In [137]:
top_name[['name']]
# top_name = top_name.drop('births', axis=1)
# top_name

                      name
year sex
1880 F   0            Mary
     M   942          John
1881 F   2000         Mary
     M   2938         John
1882 F   3935         Mary
...                    ...
2008 M   1607754     Jacob
2009 F   1622344  Isabella
     M   1642467     Jacob
2010 F   1656946  Isabella
     M   1676644     Jacob

[262 rows x 1 columns]

# 3. 모음의 개수 변화(a, e, i, o u)

예시>  
1800년  
john : 1000명 -> 모음개수 : 1*1000 = 1000  
emma : 500명 -> 모음개수 2*500 = 1000  
<br/>


모음개수를 모두 합친다 (연도 및 성별)    
<br/>


최종>

year|남자|여자
 ---|---|---
1800|20000|30000
...|...|...
2010|150000|120000